---
type: PreDocEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 1
tags: [revit-api, class]
---

# PreDocEventArgs

`Autodesk.Revit.DB.Events.PreDocEventArgs` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Document | — | `public Document Document { get ; }` |